{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 64, 64, 3], "init": "glorot_uniform", "border_mode": "same", "activation": "elu", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24, "trainable": true, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "same", "activation": "elu", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 36, "trainable": true, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "same", "activation": "elu", "nb_row": 5, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 48, "trainable": true, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "border_mode": "same", "activation": "elu", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatialdropout2d_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform", "border_mode": "same", "activation": "elu", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_5", "pool_size": [2, 2], "border_mode": "same"}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatialdropout2d_2", "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "elu", "input_dim": 256, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 100, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "elu", "input_dim": 100, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 50, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activation": "elu", "input_dim": 50, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activation": "linear", "input_dim": 10, "bias": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "trainable": true, "b_constraint": null}}]}